-- MySQL dump 10.13  Distrib 8.0.27, for Linux (x86_64)
--
-- Host: 127.0.0.1    Database: gdstmain
-- ------------------------------------------------------
-- Server version	8.0.27-0ubuntu0.20.04.1

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `labgen`
--

DROP TABLE IF EXISTS `labgen`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `labgen` (
  `id_key` int NOT NULL AUTO_INCREMENT,
  `접수일자/접수번호` text,
  `결과완료일` int DEFAULT NULL,
  `수진자명` text,
  `주민번호01` text,
  `나이` int DEFAULT NULL,
  `성별` text,
  `차트번호` text,
  `검사명` text,
  `검사결과` double DEFAULT NULL,
  `보험코드` text,
  `검체명` text,
  `단위` text,
  `참고치` text,
  `검사코드` int DEFAULT NULL,
  `서술형결과` text,
  PRIMARY KEY (`id_key`)
) ENGINE=InnoDB AUTO_INCREMENT=68 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `labgen`
--

LOCK TABLES `labgen` WRITE;
/*!40000 ALTER TABLE `labgen` DISABLE KEYS */;
INSERT INTO `labgen` VALUES (1,'20220106-12813',20220107,'김서연','030806',18,'F','','T.Protein      ',6.6,'D1840003','Serum','g/dL','6.4-8.2',1101900,''),(2,'20220106-12813',20220107,'김서연','030806',18,'F','','Albumin        ',4.5,'D1880003','Serum','g/dL','3.8-5.3',1100200,''),(3,'20220106-12813',20220107,'김서연','030806',18,'F','','T.Bilirubin    ',0.74,'D1830003','Serum','mg/dL','성인:0.20-1.20',1100800,''),(4,'20220106-12813',20220107,'김서연','030806',18,'F','','BUN',9.4,'D2300003','Serum','mg/dL','8.0-23.0',1100900,''),(5,'20220106-12813',20220107,'김서연','030806',18,'F','','Creatinine',0.68,'D2280003','Serum','mg/dL','0.30-1.30',1101400,''),(6,'20220106-12813',20220107,'김서연','030806',18,'F','','GFR',113,'','Serum','','',1108900,''),(7,'20220106-12813',20220107,'김서연','030806',18,'F','','Uric acid      ',3.4,'D2310003','Serum','mg/dL','F:2.8-6.1',1102300,''),(8,'20220106-12813',20220107,'김서연','030806',18,'F','','AST(sGOT)      ',19,'D1860003','Serum','IU/L','0-40',1103700,''),(9,'20220106-12813',20220107,'김서연','030806',18,'F','','ALT(sGPT)      ',14,'D1850003','Serum','IU/L','0-40',1103300,''),(10,'20220106-12813',20220107,'김서연','030806',18,'F','','ALP            ',79,'D1870003','Serum','U/L','성인:35-130_x000d_\n',1103200,''),(11,'20220106-12813',20220107,'김서연','030806',18,'F','','GGT(γ-GTP)',7,'D1890003','Serum','IU/L','F: <38_x000d_\n',1104200,''),(12,'20220106-12813',20220107,'김서연','030806',18,'F','','LDH            ',246,'D2510053','Serum','U/L','200-450',1104500,''),(13,'20220106-12813',20220107,'김서연','030806',18,'F','','CK,total(CPK)   ',51,'D2510013','Serum','U/L','F:34-145',1103900,''),(14,'20220106-12813',20220107,'김서연','030806',18,'F','','Amylase        ',56,'D3800023','Serum','U/L','28-110_x000d_\n',1103400,''),(15,'20220106-12813',20220107,'김서연','030806',18,'F','','Cholesterol, total',175,'D2611003','Serum','mg/dL','200 미만 Normal_x000d_\n200-239 Borderline_x000d_\n240 이상 High_x000d_\n',1105900,''),(16,'20220106-12813',20220107,'김서연','030806',18,'F','','Triglyceride   ',150,'D2263003','Serum','mg/dL','150 미만 Normal_x000d_\n150-199 Borderline_x000d_\n200 이상 High',1107400,''),(17,'20220106-12813',20220107,'김서연','030806',18,'F','','HDL-cholesterol ',63,'D2613003','Serum','mg/dL','< 40:Low_x000d_\n(major risk factor for CHD) _x000d_\n≥ 60:High_x000d_\n(negative risk factor for CHD)',1106400,''),(18,'20220106-12813',20220107,'김서연','030806',18,'F','','LDL-cholesterol ',88,'D2614003','Serum','mg/dL','< 100:Optimal_x000d_\n100-129:_x000d_\nNear or above optimal_x000d_\n130-159:Borderline _x000d_\n160-189:High_x000d_\n> 190:Very high_x000d_\n',1106600,''),(19,'20220106-12813',20220107,'김서연','030806',18,'F','','Calcium (Ca)',9.6,'D2800053','Serum','mg/dL','8.6-10.4',1108500,''),(20,'20220106-12813',20220107,'김서연','030806',18,'F','','Phosphorus (P)',4.5,'D2800043','Serum','mg/dL','2.4-5.1',1109500,''),(21,'20220106-12813',20220107,'김서연','030806',18,'F','','Sodium (Na)',139,'D2800023','Serum','mmol/L','135-145_x000d_\n',1110000,''),(22,'20220106-12813',20220107,'김서연','030806',18,'F','','Chloride (Cl)  ',103,'D2800033','Serum','mmol/L','98-110_x000d_\n',1108700,''),(23,'20220106-12813',20220107,'김서연','030806',18,'F','','Potassium (K)  ',4.3,'D2800063','Serum','mmol/L','3.5-5.5',1109700,''),(24,'20220106-12813',20220107,'김서연','030806',18,'F','','Iron (Fe)       ',91,'D0521033','Serum','μg/dL','F:32-153',1110500,''),(25,'20220106-12813',20220107,'김서연','030806',18,'F','','TIBC           ',325,'D0521043','Serum','μg/dL','F:223-422',1111200,''),(26,'20220106-12813',20220106,'김서연','030806',18,'F','','Glucose        ',82,'D3022003','NaF','mg/dL','100 미만 Normal_x000d_\n100-125 Borderline_x000d_\n126 이상 High',1107900,''),(27,'20220106-12813',20220107,'김서연','030806',18,'F','','HbA1C          ',4.8,'D3063003','EDTA W/B','%','4.0-6.4',1108400,''),(30,'20220106-12813',20220106,'김서연','030806',18,'F','','WBC count       ',3.85,'D0002013','EDTA W/B','천/㎕','4.00-11.00_x000d_\n',1290000,''),(31,'20220106-12813',20220106,'김서연','030806',18,'F','','RBC count        ',4.44,'D0002033','EDTA W/B','백만/㎕','F:3.70-5.20',1290100,''),(32,'20220106-12813',20220106,'김서연','030806',18,'F','','Hemoglobin            ',14.6,'D0002053','EDTA W/B','g/㎗','F:11.0-16.0',1290200,''),(33,'20220106-12813',20220106,'김서연','030806',18,'F','','Hematocrit      ',40.4,'D0002043','EDTA W/B','%','F:36.0-46.0_x000d_\n',1290300,''),(34,'20220106-12813',20220106,'김서연','030806',18,'F','','MCV            ',91.1,'','EDTA W/B','fL','80.0-100.0_x000d_\n',1290400,''),(35,'20220106-12813',20220106,'김서연','030806',18,'F','','MCH            ',32.9,'','EDTA W/B','pg','26.0-34.0_x000d_\n',1290500,''),(36,'20220106-12813',20220106,'김서연','030806',18,'F','','MCHC           ',36.1,'','EDTA W/B','g/㎗','31.0-37.0_x000d_\n',1290600,''),(37,'20220106-12813',20220106,'김서연','030806',18,'F','','RDW            ',13.6,'D0002023','EDTA W/B','%','12.1-16.2',1290800,''),(38,'20220106-12813',20220106,'김서연','030806',18,'F','','Platelet       ',388,'D0002073','EDTA W/B','천/㎕','140-400',1290700,''),(39,'20220106-12813',20220106,'김서연','030806',18,'F','','MPV            ',7.1,'','EDTA W/B','fL','8.0-12.0',1291000,''),(40,'20220106-12813',20220106,'김서연','030806',18,'F','','PCT            ',0.275,'','EDTA W/B','%','0.100-0.500',1290900,''),(41,'20220106-12813',20220106,'김서연','030806',18,'F','','PDW            ',15.7,'D0002063','EDTA W/B','%','8.0-18.0',1291100,''),(42,'20220106-12813',20220106,'김서연','030806',18,'F','','Basophil',0.5,'','EDTA W/B','%','',1201205,''),(44,'20220106-12813',20220106,'김서연','030806',18,'F','','Eosinophil',2.6,'','EDTA W/B','%','',1201204,''),(45,'20220106-12813',20220106,'김서연','030806',18,'F','','Lymphocyte',49.9,'','EDTA W/B','%','',1201201,''),(46,'20220106-12813',20220106,'김서연','030806',18,'F','','Monocyte',5.5,'','EDTA W/B','%','',1201202,''),(47,'20220106-12813',20220106,'김서연','030806',18,'F','','Neutrophil seg.',41.5,'','EDTA W/B','%','',1201203,''),(48,'20220106-12813',20220106,'김서연','030806',18,'F','','Other',0,'','EDTA W/B','%','',1201206,''),(49,'20220106-12813',20220107,'김서연','030806',18,'F','','ESR            ',6,'D0100013','EDTA W/B','mm/hrs','F:0-20',1201600,''),(50,'20220106-12813',20220107,'김서연','030806',18,'F','','25-OH-Vit.D',19.6,'D4902023','Serum','ng/mL','Sufficiency:30.0-100.0_x000d_\nDeficiency:<20.0_x000d_\nInsufficiency:20.0-29.9_x000d_\nToxicity:>100.0 _x000d_\n',1326700,''),(51,'20220106-12813',20220107,'김서연','030806',18,'F','','T4             ',10.3,'D3230043','Serum','㎍/dL','13-20y:5.5-11.1',1308800,''),(52,'20220106-12813',20220107,'김서연','030806',18,'F','','TSH            ',1.79,'D3250013','Serum','mIU/L','13-20y:0.48-4.17',1309300,''),(55,'20220106-12813',20220107,'김서연','030806',18,'F','','CA19-9',23.26,'D4350003','Serum','U/mL','≤37.00 ',1321100,''),(56,'20220106-12813',20220107,'김서연','030806',18,'F','','CA125',30.4,'D4311003','Serum','U/mL','≤35.0',1321500,''),(58,'20220106-12813',20220107,'김서연','030806',18,'F','','CRP 정량       ',0.1,'D0113003','Serum','mg/dL','0.1-0.5',1405400,''),(65,'20220106-12813',20220106,'김서연','030806',18,'F','','Specific gravity',1.016,'','Urine (Random)','','',1701701,''),(67,'20220106-12813',20220106,'김서연','030806',18,'F','','PH',8,'','Urine (Random)','','',1701702,'');
/*!40000 ALTER TABLE `labgen` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-01-08 16:46:16
